package com.theZ.dotoring.enums;

public enum Major {

    가정교육과, 간호학과, 건축_도시설계전공, 건축공학전공, 건축디자인학과, 건축학부, 경영학부, 경제학부, 고분자융합소재공학부, 교육학과, 국악학과_가야금, 국악학과_거문고, 국악학과_국악성악전공, 국악학과_국악작곡이론전공, 국악학과_대금, 국악학과_아쟁, 국악학과_타악, 국악학과_피리, 국악학과_해금, 국어교육과, 국어국문학과, 국제학부_영어학전공, 국제학부_일본학전공, 국제학부_중국학전공, 글로벌비즈니스학부, 기계공학부, 기계설계공학과, 기계시스템공학과, 기관시스템공학과, 냉동공조공학과, 농생명화학과, 농업경제학과, 독일언어문학과, 동물자원학부, 디자인학과, 멀티미디어전공, 메카트로닉스공학과, 문헌정보학과, 문화관광경영학과, 문화인류고고학과, 문화콘텐츠학부, 물류교통학과, 물리교육과, 물리학과, 미술학과_공예전공, 미술학과_서양화전공, 미술학과_이론전공, 미술학과_조소전공, 미술학과_한국화전공, 바이오에너지공학과, 분자생명공학과, 불어불문학과, 빅데이터융합학과, 사학과, 사회학과, 산림자원학과, 산업공학과, 산업기술융합공학과_야간, 생명과학기술학부, 생물공학과, 생물교육과, 생물학과, 생활복지학과, 석유화학소재공학;
}
